Revit 2020 API
LabelUtils.GetLabelFor Method
Overload List
Name | Description
GetLabelFor(BuiltInCategory)
 Gets the user-visible name for a BuiltInCategory.
GetLabelFor(BuiltInParameter)
 Gets the user-visible name for a BuiltInParameter.
GetLabelFor(BuiltInParameterGroup)
 Gets the user-visible name for a BuiltInParameterGroup.
GetLabelFor(DisplayUnitType)
 Gets the user-visible name for a DisplayUnitType.
GetLabelFor(ParameterType)
 Gets the user-visible name for a ParameterType.
GetLabelFor(UnitSymbolType)
 Gets the user-visible name for a UnitSymbolType.
GetLabelFor(UnitType)
 Gets the user-visible name for a UnitType.
GetLabelFor(BuiltInParameter, LanguageType)
 Gets the user-visible name for a BuiltInParameter in a specific LanguageType.
GetLabelFor(DuctLossMethodType, Document)
 Gets the user-visible name for a DuctLossMethodType.
GetLabelFor(gbXMLBuildingType, Document)
 Gets the user-visible name for a gbXMLBuildingType.
GetLabelFor(PipeFlowState, Document)
 Gets the user-visible name for a PipeFlowState.
GetLabelFor(PipeLossMethodType, Document)
 Gets the user-visible name for a PipeLossMethodType.
See Also
LabelUtils Class
LabelUtils Members
Autodesk.Revit.DB Namespace